app/views/comments/_comment.html.erb

		<div class="profile-photo"><a href="<%= user_trips_path(comment.user) %>" class="micro-profile-photo">
			<%= image_tag(comment.user.avatar.url(:micro)) unless comment.user.avatar_file_name.blank? rescue nil %>
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 2 LIMIT 1