app/views/hikes/_hike.html.erb

SELECT COUNT(*) FROM `comments` WHERE (`comments`.hike_id = 3)
SELECT `comments`.* FROM `comments` WHERE (`comments`.hike_id = 3)
---
		<%= markdown(hike.report) %>
		<p><%= image_tag("comment.png") %> <%= link_to "#{hike.comments.length} comments", "#{user_hike_path(@user,hike)}#comments" %></p>

SELECT `photos`.* FROM `photos` WHERE (`photos`.hike_id = 3) ORDER BY photos.taken_at ASC
---
		</ul>
		<% unless hike.photos.blank? %>