app/views/hikes/show.html.erb

				<div class="profile-photo"><a href="<%= user_hikes_path(hike.user) %>" class="micro-profile-photo">
					<%= image_tag(hike.user.avatar.url(:micro)) unless hike.user.avatar_file_name.blank? %>
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 2 LIMIT 1