app/views/hearts/_form.html.erb

	<% end %>
	<%= @hike.hearts.count if @hike.hearts.count > 0 %>
---
SELECT COUNT(*) FROM `hearts` WHERE (`hearts`.hike_id = 1)
SELECT `hearts`.* FROM `hearts` WHERE `hearts`.`hike_id` = 1 AND (`hearts`.hike_id = 1) LIMIT 1