app/views/static/home.html.erb

<% title "Hiking and backpacking statistics tracker" %>
<% @hikes = Hike.all %>
---
SELECT `hikes`.* FROM `hikes` ORDER BY hiked_at DESC, created_at DESC

<% content_for :header do %>
<p class="main_lede">A tool for recording your trips into the wilderness, and discovering new ones. Join the <%= User.count %> members and add to the <%= Hike.count %> hikes already recorded.</p>
---
SELECT `users`.* FROM `users` WHERE (ytd_mileage > 0 AND ytd_elevation > 0)

<script type="text/javascript">
$(document).ready(function(){
	beef.defaults.zoom 			= 4;
	beef.defaults.lat			= 45;
	beef.defaults.lng			= -105;
	beef.defaults.doubleclick 	= true;
	beef.defaults.scrollwheel 	= false;
	beef.load();
	topo();

	// Load all the markers
	beef.markers.populate(<%= @hikes.map { |hike| {
		:id 			=> hike.id,
		:lat 			=> hike.lat,
		:lng			=> hike.lng,
		:info			=> "<p>#{link_to(hike.name, user_hike_path(hike.user, hike))}</p>
							<p>Hiked #{hike.hiked_at.strftime('%D')} by
							#{link_to(hike.user.name, user_hikes_path(hike.user))}</p>"
	} }.to_json %>);

	// beef.zoomToMarkers();
});
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1

	<h2>Latest Hikes</h2>
	<% @hikes = Hike.all(:limit => 15, :order => "hiked_at DESC, created_at DESC") %>
---
SELECT `hikes`.* FROM `hikes` ORDER BY hiked_at DESC, hiked_at DESC, created_at DESC LIMIT 15

			<p class="links">
				<%= link_to("#{image_tag("page_white_text.png")} Read full report", user_hike_path(hike.user, hike)) unless hike.report.blank? %>
				<%= link_to("#{image_tag("comment.png")} #{hike.comments.length} comments", "#{user_hike_path(hike.user, hike)}#comments") %>
---
SELECT `users`.* FROM `users` ORDER BY ytd_mileage DESC LIMIT 10
SELECT `comments`.* FROM `comments` WHERE (`comments`.hike_id = 3)