app/controllers/comments_controller.rb

INSERT INTO `comments` (`user_id`, `hike_id`, `body`, `created_at`, `updated_at`) VALUES (2, 1, 'comment.', '2011-05-07 00:30:57', '2011-05-07 00:30:57')
SELECT `comments`.* FROM `comments` WHERE (`comments`.hike_id = 1)
SELECT `users`.* FROM `users` WHERE `users`.`id` = 2 LIMIT 1
---
  def create
		@comment = Comment.new(params[:comment])
		@trip = @comment.trip
		@author = @comment.user
		if @comment.save
			WebsiteMailer.comment_posted(@comment).deliver if @trip.user.notify_on_comment && (@trip.user.id != @author.id)

			@replies = @trip.comments.map{ |c| c.user }.uniq