app/controllers/hearts_controller.rb

  def create
		@hike = Hike.find(params[:hike_id])
		if current_user.id != @hike.user.id
			@heart = Heart.find_or_create_by_user_id_and_hike_id(:user_id => current_user.id, :hike_id => params[:hike_id])
---
SELECT `hikes`.* FROM `hikes` WHERE `hikes`.`id` = 1 ORDER BY hiked_at DESC LIMIT 1
INSERT INTO `hearts` (`user_id`, `hike_id`, `created_at`, `updated_at`) VALUES (1, 1, '2011-05-17 14:57:56', '2011-05-17 14:57:56')
SELECT `hearts`.* FROM `hearts` WHERE `hearts`.`user_id` = 1 AND `hearts`.`hike_id` = 1 LIMIT 1

  def destroy
		@heart = Heart.find_by_user_id_and_hike_id(current_user.id, params[:hike_id])
		@hike = @heart.hike
		@hearts = @hike.hearts
		@heart.destroy
---
SELECT `hearts`.* FROM `hearts` WHERE `hearts`.`user_id` = 1 AND `hearts`.`hike_id` = 1 LIMIT 1
DELETE FROM `hearts` WHERE `hearts`.`id` = 1