app/controllers/hikes_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`id` = 2 LIMIT 1
SELECT `hikes`.* FROM `hikes` WHERE (`hikes`.user_id = 2) AND (hiked_at >= '2011-01-01' AND hiked_at <= '2011-12-31') ORDER BY hiked_at DESC
---
	def index
		@year = params[:year].try(:to_i)
		@year ||= DateTime.now.year

		@user = User.find(params[:user_id]) unless params[:user_id].blank?
		@user ||= current_user rescue nil

		@hikes = @user.hikes.year(@year)
		@other_years_hikes = @user.hikes.map{|h| h.hiked_at.year }.uniq.reject{|h| h == @year}

SELECT `hikes`.* FROM `hikes` WHERE (name LIKE '%test%' OR report LIKE '%test%') ORDER BY hiked_at DESC, hiked_at DESC, name ASC
---
	def search
		@hikes = Hike.where("name LIKE ? OR report LIKE ?", "%#{params[:q]}%", "%#{params[:q]}%").order("hiked_at DESC, name ASC")

SELECT `hikes`.* FROM `hikes` ORDER BY hiked_at DESC
---
	def advanced_search
		@hikes = Hike.all

SELECT `hikes`.* FROM `hikes` WHERE `hikes`.`id` = 1 ORDER BY hiked_at DESC LIMIT 1
SELECT `hearts`.* FROM `hearts` WHERE `hearts`.`hike_id` = 1 AND `hearts`.`user_id` IS NULL AND (`hearts`.hike_id = 1) LIMIT 1
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
SELECT `comments`.* FROM `comments` WHERE (`comments`.hike_id = 3)
---
	def show
		@hike = Hike.find(params[:id])
		@user = @hike.user
		@heart = @hike.hearts.find_or_initialize_by_hike_id_and_user_id(@hike.id, current_user.try(:id))
		@comments = @hike.comments
		@hearts = @hike.hearts
		@comment = Comment.new(:hike_id => @hike.id, :user_id => current_user.id) rescue nil
		@nearby_hikes = Hike.within(10, :origin => [@hike.lat,@hike.lng]).order("distance DESC").where("id != ?", @hike.id).limit(10)
		@forecast = Forecast.find_or_create_by_lat_and_lng(@hike.lat, @hike.lng)