app/controllers/photos_controller.rb

	def create
		@hike = Hike.find(params[:hike_id])
		@user = @hike.user
		redirect_to :back if @user.id != current_user.id

		@photo = @hike.photos.build(params[:photo])
		if @photo.save
---
SELECT `hikes`.* FROM `hikes` WHERE `hikes`.`id` = 1 ORDER BY hiked_at DESC LIMIT 1
INSERT INTO `photos` (`image_file_name`, `image_content_type`, `image_file_size`, `image_updated_at`, `width`, `height`, `taken_at`, `lat`, `lng`, `caption`, `hike_id`, `user_id`, `camera_model`, `camera_exposure`, `camera_f_stop`, `camera_iso`, `created_at`, `updated_at`) VALUES ('bears_life.jpg', 'image/jpeg', 1830148, '2011-05-05 23:41:50', NULL, NULL, NULL, NULL, NULL, '', 1, NULL, NULL, NULL, NULL, NULL, '2011-05-05 23:41:53', '2011-05-05 23:41:53')

	def destroy
		@photo = Photo.find(params[:id])
		if @photo.hike.user.id != current_user.id
			redirect_to :back
		else
			@photo.destroy
---
SELECT `photos`.* FROM `photos` WHERE `photos`.`id` = 2 ORDER BY photos.taken_at ASC LIMIT 1
DELETE FROM `photos` WHERE `photos`.`id` = 2