app/controllers/static_controller.rb

	def home
		@hikes = Hike.all(:include => :user)
		@top_mileage = User.limit(10).order("ytd_mileage DESC")
		@top_elevation = User.where(["ytd_mileage > ? AND ytd_elevation > ?", 0, 0]).order("ytd_elevation DESC").limit(5)
		@top_nights = User.where(["ytd_nights > ? AND ytd_mileage > ?", 0, 0]).order("ytd_nights DESC").limit(5)
		@newest_members = User.limit(5).order("created_at DESC")
		@top_hikes = Hike.limit(5).where("")
		@user_count = User.count
---
SELECT `hikes`.* FROM `hikes` ORDER BY hiked_at DESC, created_at DESC
SELECT `users`.* FROM `users` WHERE (ytd_mileage > 0 AND ytd_elevation > 0) ORDER BY ytd_elevation DESC
SELECT `users`.* FROM `users` ORDER BY ytd_mileage DESC LIMIT 10
SELECT `users`.* FROM `users` WHERE (ytd_mileage > 0 AND ytd_elevation > 0) ORDER BY ytd_elevation DESC LIMIT 5
SELECT `users`.* FROM `users` WHERE (ytd_nights > 0 AND ytd_mileage > 0) ORDER BY ytd_nights DESC LIMIT 5
SELECT COUNT(*) FROM `users`