app/controllers/users_controller.rb

  def update
    @user = current_user
    if @user.update_attributes(params[:user])
---
UPDATE `users` SET `password_salt` = '45ywds2AZ4J-oLzvjWjX', `crypted_password` = 'c6442e70a408c8335ba95583e2f5d0eb747ef6e562306daf621245638eea94ecd401e627b11b2f3ccabeb1c9d6ab2e9936e7afaba1e48bcfd09d8a2f264f1d9d', `persistence_token` = '22c0e6da7a41b01af3479c7674a2054ae87550002329ac3bfd1120b453c85124ff3fb8d422f5b6601641fad2bc8d8b5195e1e7f035e62442b3d45c41e2ac824f', `updated_at` = '2011-05-17 14:26:47' WHERE `users`.`id` = 1

  def reset_password
    @user = User.find_by_email(params[:email])
---
SELECT `users`.* FROM `users` WHERE `users`.`email` = 'kmeyer@kittelson.com' LIMIT 1